const N = 6;
const r = 5,
  c = 4;
const arr = [
  [1],
  [3, 2],
  [4, 5, 6],
  [10, 9, 8, 7],
  [11, 12, 13, 14, 15],
  [21, 20, 19, 18, 17, 16],
  [22, 23, 24, 25, 26],
  [30, 29, 28, 27],
  [31, 32, 33],
  [35, 34],
  [36],
];

/*
[1, 2, 6, 7, 15, 16]
[3, 5, 8, 14, 17, 26]
[4, 9, 13, 18, 25, 27]
[10, 12, 19, 24, 28, 33]
[11, 20, 23, 29, 32, 34]
[21, 22, 30, 31, 35, 36]
*/

const zigzag = [
  [0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0],
  [0, 0, 0, 0, 0, 0],
];
let odd = true;
let num = 1;
let rowCnt = 1;
while (num < N ** 2) {
  if (odd) {
    // odd: 홀수
    // y 부터 시작해서 (y - 0, x + 0), (y - 1, x + 1), (y - 2, x + 2), ... (0, x + y) 까지
    for (let j = 0; j < rowCnt; j++) {
      zigzag[rowCnt - j - 1][j] = num++;
    }
  } else {
    // even: 짝수
    // x 부터 시작해서 (y - 1, x + 1), (y - 2, x + 2), ... (0, x + y) 까지
    for (let j = 0; j < rowCnt; j++) {
      zigzag[j][rowCnt - j - 1] = num++;
    }
  }

  console.log(0);

  rowCnt++;
  odd = !odd;
}

console.log(JSON.stringify(zigzag));
